import { Component }  from 'react';

class VirtualDom extends Component{
    render(){
        return(
            <div  className='content'>
                <h2 className='content_header'>Виртуальный DOM</h2>
                <span>
                    Виртуальный DOM (VDOM) — это концепция программирования, в которой «виртуальное» представление пользовательского интерфейса хранится в памяти и синхронизируется с «настоящим» DOM при помощи библиотеки, такой как ReactDOM. Этот процесс называется согласованием.
                </span>
                <span>
                    DOM расшифровывается как Document Object Model (объектная модель документа). При каждом изменении UI (user interface), DOM также обновляется для отображения этих изменений. Частые манипуляции с DOM негативно влияют на производительность.
                </span>
                <span>
                    DOM представляет собой древовидную структуру данных. Поэтому изменения и обновления самого DOM являются достаточно быстрыми. Но после изменения обновленный элемент и все его потомки (дочерние элементы) должны быть повторно отрисованы (отрендерены) для обновления UI приложения. Повторный рендеринг — очень медленный процесс. Таким образом, чем больше у нас компонентов UI, тем более дорогими с точки зрения производительности являются обновления DOM.
                </span>
                <span>
                    Манипуляции с RDOM являются медленными. Манипуляции с VDOM намного быстрее, поскольку они не отображаются (отрисовываются) на экране.
                </span>
                <span>
                    Когда в UI добавляются новые элементы, создается VDOM в виде дерева. Каждый элемент является узлом этого дерева. При изменении состояния любого элемента, создается новое дерево. Затем это новое дерево сравнивается (diffed) со старым.
                </span>
                <span>
                    После этого вычисляется наиболее эффективный метод внесения изменений в RDOM. Цель данных вычислений состоит в минимизации количества операций, совершаемых с RDOM. Тем самым, уменьшаются накладные расходы, связанные с обновлением RDOM.
                </span>
                <span>
                    После этого вычисляется разница между предыдущей и текущей версиями виртуального DOM-дерева. Затем все родительское поддерево подвергается повторному рендерингу для представления обновленного UI. Наконец, это обновленное дерево используется для обновления RDOM.
                </span>
                <span>
                    В React каждая часть UI является компонентом и почти каждый компонент имеет состояние (state). При изменении состояния компонента, React обновляет VDOM. После обновления VDOM, React сравнивает его текущую версию с предыдущей. Этот процесс называется «поиском различий» (diffing).
                </span>
                <span>
                    После обнаружения объектов, изменившихся в VDOM, React обновляет соответствующие объекты в RDOM. Это существенно повышает производительность по сравнению с прямыми манипуляциями DOM. Именно это делает React высокопроизводительной библиотекой JavaScript.
                </span>
                <span>
                    React использует эвристический O(n) (линейный) алгоритм, основываясь на двух предположениях:
                </span>
                <ul>
                    <li>Два элемента разных типов приводят к построению разных деревьев</li>
                    <li>Разработчик может обеспечить стабильность элементов между рендерингами посредством пропа key (ключ)</li>
                </ul>
            </div>
        )
    }
}

export default VirtualDom;